{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vocab_embed_weight", 
      "attr": {
        "input_dim": "5000", 
        "output_dim": "50"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "vocab_embed", 
      "attr": {
        "input_dim": "5000", 
        "output_dim": "50"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape12", 
      "attr": {"target_shape": "(64, 1, 500, 50)"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution12_weight", 
      "attr": {
        "kernel": "(3, 50)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution12_bias", 
      "attr": {
        "kernel": "(3, 50)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attr": {
        "kernel": "(3, 50)", 
        "num_filter": "100"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling12", 
      "attr": {
        "kernel": "(498, 1)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution13_weight", 
      "attr": {
        "kernel": "(4, 50)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution13_bias", 
      "attr": {
        "kernel": "(4, 50)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attr": {
        "kernel": "(4, 50)", 
        "num_filter": "100"
      }, 
      "inputs": [[3, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling13", 
      "attr": {
        "kernel": "(497, 1)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution14_weight", 
      "attr": {
        "kernel": "(5, 50)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution14_bias", 
      "attr": {
        "kernel": "(5, 50)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attr": {
        "kernel": "(5, 50)", 
        "num_filter": "100"
      }, 
      "inputs": [[3, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation14", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling14", 
      "attr": {
        "kernel": "(496, 1)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat4", 
      "attr": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[8, 0, 0], [13, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape13", 
      "attr": {"target_shape": "(64, 300)"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "final_fc_weight", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "final_fc_bias", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "final_fc", 
      "attr": {"num_hidden": "2"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    4, 
    5, 
    9, 
    10, 
    14, 
    15, 
    21, 
    22, 
    24
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26
  ], 
  "heads": [[25, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1100]}
}