{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vocab_embed_weight", 
      "attr": {
        "input_dim": "5000", 
        "output_dim": "50"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "vocab_embed", 
      "attr": {
        "input_dim": "5000", 
        "output_dim": "50"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape11", 
      "attr": {"target_shape": "(64, 1, 500, 50)"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(5, 50)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {
        "kernel": "(5, 50)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(5, 50)", 
        "num_filter": "100"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten4", 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "final_fc_weight", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "final_fc_bias", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "final_fc", 
      "attr": {"num_hidden": "2"}, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 4, 5, 8, 9, 11], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13
  ], 
  "heads": [[12, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1100]}
}